package com.easycook.core;

import android.R;

public class Config {

	public static final String ERROR = "error";
	public static final String PRE = "pre";
	public static final String NEXT = "next";
	public static final String QUIT = "quit";
	
	public static final String[] STEPS = {"首先，您需要准备以下食材，准备之后请说“下一步”",//1
		"将白菜叶撕下，洗洗干净，如图所示。完成之后请说“下一步”",//2
		"将白菜叶和白菜梆分开，如图所示，完成之后请说“下一步”",//3
		"将白菜帮切成块，如图所示，完成之后请说“下一步”",//4
		"用手将白菜叶撕碎，与白菜梆分开放置，如图所示，完成之后请说“下一步”",//5
		"下面开始勾兑芡汁，请准备好以下调料。准备好请说“下一步”",//6
		"取五瓣大蒜，将它切成蒜片，放在旁边备用，如图所示，完成之后请说“下一步”",//7
		"取两根葱，将它切成碎末，放在旁边备用，如图所示，完成之后请说“下一步”",//8
		"切三片生姜，放在旁边备用，如图所示，完成之后请说“下一步”",//9
		"在碗中加入三勺醋，一勺糖，如图所示，完成之后请说“下一步”",//10
		"继续加入两勺盐，一勺酱油，如图所示，完成之后请说“下一步”",//11
		"继续加入两勺淀粉，搅拌均匀，如图所示，完成之后请说“下一步”",//12
		"加入蒜片、葱末，如图所示，完成之后请说“下一步”",//13
		"加入少量的水，如图所示，芡汁勾兑完毕，放在一旁备用，完成之后请说“下一步”",//14
		"下面进入爆炒环节，时间将会受到严格控制，请把以下材料放在触手可及的地方，如图所示，完成之后请说“下一步”",//15
		"加入适量的油，如图所示，完成之后请说“下一步”",//16
		//倒计时五秒
		"现在开大火，五秒钟之后加入姜片",//油锅炸油图//倒计时5秒//17
		"现在加入姜片。五秒钟之后后加入白菜梆，现在开始倒计时",//姜片下锅图//倒计时5秒//18
		"现在加入白菜梆，并迅速翻炒，四十秒后加入芡汁和白菜叶，现在开始倒计时",//显示40秒倒计时//19
		"现在加入白菜叶和芡汁，并均匀翻炒，等待芡汁收干后即可出锅，大约需要两分钟，现在开始倒计时",//显示120秒倒计时//20
		"亲，芡汁是否已经收干？如果收干了就可以出锅了哦",
		"恭喜你学会了醋溜大白菜"};//22
	
		public static final int[] images = {};
		
		/**
		 * 对应每一步是否需要倒计时：0表示不需要，非0表示倒计时的秒数
		 */
		public static final int[] isDaojishi = {0,0,5,0,0,0,0,0,0,0,0,0,0,0,0,0,5,5,40,120,-1};
}
